rkz/extension/Documents/ЗаказНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЗаказНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Приоритеты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ТипПроизводственногоПроцесса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПроизводственныхПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказовНаПроизводство2_2</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДатаПотребности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НачатьНеРанее</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>бит_ПереданВПроизводство</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Продукция</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимости</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Отменено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ПричинаОтмены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныОтменыПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Упаковка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаАктивовПассивов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиАктивовПассивов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КоличествоУпаковок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Спецификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РесурсныеСпецификации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Назначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>ДоляСтоимостиНаЕдиницу</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СписатьНаРасходы</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>СтатьяРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>АналитикаРасходов</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.СтатьиРасходов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>КлючНоменклатура</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

rkz/extension/Enums/СтатусыЗаказовНаПроизводство2_2.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СтатусыЗаказовНаПроизводство2_2</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

rkz/extension/Documents/ЗаказНаПроизводство2_2/Forms/бит_ФормаПакетЗаказов/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	МАКСИМУМ(бит_ПакетыЗаказовВПроизводствоСрезПоследних.НомерПакета) КАК НомерПакета
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.бит_ПакетыЗаказовВПроизводство.СрезПоследних(, Период = &ТекущаяДата) КАК бит_ПакетыЗаказовВПроизводствоСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.НомерПакета КАК НомерПакета
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВременнаяТаблица.НомерПакета, 0) = 0");

	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));

	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда 
		ЭтотОбъект.бит_НомерНовогоПакета = 1; 
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();  
		
		ЭтотОбъект.бит_НомерНовогоПакета = Выборка.НомерПакета + 1;
	КонецЕсли;
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецПроцедуры	
	
&НаСервере
Функция СформироватьПакетЗаказовНаСервере() 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 
	ДокументыДляПечати = Новый Массив; 
	ДатаЗаписи = НачалоДня(ТекущаяДата()); 
	
	//Перепроверяю актуальность номера пакета
	Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	МАКСИМУМ(бит_ПакетыЗаказовВПроизводствоСрезПоследних.НомерПакета) КАК НомерПакета
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.бит_ПакетыЗаказовВПроизводство.СрезПоследних(, Период = &ТекущаяДата) КАК бит_ПакетыЗаказовВПроизводствоСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВременнаяТаблица.НомерПакета КАК НомерПакета
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|ГДЕ
		|	НЕ ЕСТЬNULL(ВременнаяТаблица.НомерПакета, 0) = 0");

	Запрос.УстановитьПараметр("ТекущаяДата", ДатаЗаписи);

	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если РезультатЗапроса.Пустой() Тогда 
		НомерНовогоПакета = 1; 
	Иначе 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		
		НомерНовогоПакета = Выборка.НомерПакета + 1;
	КонецЕсли;
	
	//Ищу нужные заказы
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ИСТИНА КАК НеВключатьВСуточныйПакет,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ПОМЕСТИТЬ вт_НоменклатураНеВСуточномПакете
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.бит_НеВключатьВСуточныйПакет КАК бит_НеВключатьВСуточныйПакет
		|		ПО (Номенклатура.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры
		|				ИЛИ Номенклатура.Родитель.Родитель.Родитель.Родитель = бит_НеВключатьВСуточныйПакет.бит_ГруппаНоменклатуры)
		|ГДЕ
		|	НЕ бит_НеВключатьВСуточныйПакет.ПометкаУдаления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ЗаказНаПроизводство.Ссылка КАК ЗаказНаПроизводство
		|ИЗ
		|	Документ.ЗаказНаПроизводство2_2 КАК ЗаказНаПроизводство
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказНаПроизводство2_2.Продукция КАК ЗаказНаПроизводство2_2Продукция
		|			ЛЕВОЕ СОЕДИНЕНИЕ вт_НоменклатураНеВСуточномПакете КАК вт_НоменклатураНеВСуточномПакете
		|			ПО (вт_НоменклатураНеВСуточномПакете.Номенклатура = ЗаказНаПроизводство2_2Продукция.Номенклатура)
		|		ПО (ЗаказНаПроизводство2_2Продукция.Ссылка = ЗаказНаПроизводство.Ссылка)
		|ГДЕ
		|	ЗаказНаПроизводство.Проведен
		|	И ЗаказНаПроизводство.бит_ПереданВПроизводство = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|	И ЗаказНаПроизводство.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаказовНаПроизводство2_2.Формируется)
		|	И ЕСТЬNULL(вт_НоменклатураНеВСуточномПакете.НеВключатьВСуточныйПакет, 0) = 0");


	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
		
	Пока Выборка.Следующий() Цикл 
		
		ДокументыДляПечати.Добавить(Выборка.ЗаказНаПроизводство);
		
		ОбъектЗаказНаПроизводство = Выборка.ЗаказНаПроизводство.ПолучитьОбъект(); 
		ОбъектЗаказНаПроизводство.бит_ПереданВПроизводство = ДатаЗаписи;
		ОбъектЗаказНаПроизводство.Записать();
		
		//Добавляю записи и затираю предыдущие данные по заказам
		Запись = РегистрыСведений.бит_ПакетыЗаказовВПроизводство.СоздатьНаборЗаписей();
		Запись.Отбор.ЗаказНаПроизводство.Установить(Выборка.ЗаказНаПроизводство);
		
		НоваяЗапись = Запись.Добавить(); 
		НоваяЗапись.Период 				= ДатаЗаписи; 
		НоваяЗапись.ЗаказНаПроизводство = Выборка.ЗаказНаПроизводство; 
		НоваяЗапись.НомерПакета 		= НомерНовогоПакета;  
		
		Запись.Записать();
		
	КонецЦикла; 
	
	Если НЕ ДокументыДляПечати.Количество() = 0 Тогда
		ЭтотОбъект.бит_НомерНовогоПакета = НомерНовогоПакета + 1;
	КонецЕсли;
	
	Возврат ДокументыДляПечати; 	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецФункции

&НаКлиенте
Процедура СформироватьПакетЗаказов(Команда) 
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] +  	
	ДокументыДляПечати = СформироватьПакетЗаказовНаСервере(); 
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ЗаказНаПроизводство2_2", "бит_СуточныйЗапуск", ДокументыДляПечати, ЭтаФорма,);	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -  

КонецПроцедуры

&НаСервере
Функция РаспечататьПакетЗаказовНаСервере()
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 	
	ДокументыДляПечати = Новый Массив;
	Дата = НачалоДня(ЭтотОбъект.бит_ДатаЗарегестрированногоПакета); 
	Номер = ЭтотОбъект.бит_НомераЗарегистрированныхПакетов;
	
	Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	бит_ПакетыЗаказовВПроизводствоСрезПоследних.ЗаказНаПроизводство КАК ЗаказНаПроизводство
		|ИЗ
		|	РегистрСведений.бит_ПакетыЗаказовВПроизводство.СрезПоследних(, Период = &ТекущаяДата И НомерПакета = &НомерПакета) КАК бит_ПакетыЗаказовВПроизводствоСрезПоследних");

	Запрос.УстановитьПараметр("НомерПакета", Номер);
	Запрос.УстановитьПараметр("ТекущаяДата", Дата);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл   	
		ДокументыДляПечати.Добавить(Выборка.ЗаказНаПроизводство);	
	КонецЦикла;

	Возврат ДокументыДляПечати;
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] -
	
КонецФункции

&НаКлиенте
Процедура РаспечататьПакетЗаказов(Команда)
	
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] + 	  
	ДокументыДляПечати = РаспечататьПакетЗаказовНаСервере(); 
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.ЗаказНаПроизводство2_2", "бит_СуточныйЗапуск", ДокументыДляПечати, ЭтаФорма,);
// ПервыйБИТ ЛистТребований [ЛТ29] [KAKravchenko@1cbit.ru] [20.09.2024] - 

КонецПроцедуры
